In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("salaries.csv")

In [3]:
df.head()

  company                  job     degree  salary_more_than 100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [4]:
inputs=df.drop("salary_more_than 100k",axis="columns")
target=df["salary_more_than 100k"]

In [6]:
inputs.head()

  company                  job     degree
0  google      sales executive  bachelors
1  google      sales executive    masters
2  google     business manager  bachelors
3  google     business manager    masters
4  google  computer programmer  bachelors

In [10]:
target.head()

0    0
1    0
2    1
3    1
4    0
Name: salary_more_than 100k, dtype: int64

In [11]:
from sklearn.preprocessing import LabelEncoder

In [13]:
le_company=LabelEncoder()
le_job=LabelEncoder()
le_degree=LabelEncoder()

In [16]:
inputs["company_n"]=le_company.fit_transform(inputs["company"])
inputs["job_n"]=le_job.fit_transform(inputs["job"])
inputs["degree_n"]=le_degree.fit_transform(inputs["degree"])

In [18]:
inputs.head()

  company                  job     degree  company_n  job_n  degree_n
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

In [19]:
inputs_n=inputs.drop(["company","job","degree"],axis="columns")

In [20]:
inputs_n.head()

   company_n  job_n  degree_n
0          2      2         0
1          2      2         1
2          2      0         0
3          2      0         1
4          2      1         0

In [21]:
from sklearn import tree

In [22]:
model=tree.DecisionTreeClassifier()

In [23]:
model.fit(inputs_n,target)

DecisionTreeClassifier()

In [24]:
model.predict([[0,1,2]])

array([1], dtype=int64)